Revit 2027 API
BoundaryConditionsPreset Enumeration
 Specifies the type of boundary conditions preset.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BoundaryConditionsPreset
Public Enumeration BoundaryConditionsPreset
public enum class BoundaryConditionsPreset
type BoundaryConditionsPreset
Members
Member name | Value | Description
Fixed | 0 |  Fixed boundary conditions preset.
Pinned | 1 |  Pinned boundary conditions preset.
Roller | 2 |  Roller boundary conditions preset.
User | 3 |  User-defined boundary conditions preset.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace